---
kind: enumMember
id: F:Autodesk.Revit.DB.Electrical.CircuitSequence.OddThenEven
enum: Autodesk.Revit.DB.Electrical.CircuitSequence
source: html/6875e36f-34fd-160c-1c64-69e75d0cd30f.htm
---
# Autodesk.Revit.DB.Electrical.CircuitSequence.OddThenEven

Create new circuits odd then even (1,3,5,7,9,11 / 2,4,6,8,10,12).